app/controllers/api/classified_controller.rb

SELECT  "classifieds".* FROM "classifieds" WHERE "classifieds"."author_id" = $1 LIMIT 1  [["author_id", "1"]]
---
  def account_index
    if current_user.nil?
      render json: {}
    else
      author_id = current_user.id
      @classifieds = Classified.find_by_author_id(author_id)

SELECT "cars".* FROM "cars"
INSERT INTO "classifieds" ("title", "body", "price", "odometer", "car_id", "status", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    car_params = {
      make: params['make'],
      model: params['model'],
      year: params['year']
    }

    classified_params = {
      title: params['title'],
      body: params['body'],
      price: params['price'],
      odometer: params['odometer']
    }


    car = Car.where(car_params)

    classified_params['car_id'] = car.first.id
    classified_params['status'] = 'active'
    classified_params['author_id'] = current_user.id

    @classified = Classified.new(classified_params)

    if @classified.save